# Brewfile

# --- Homebrew taps ---
tap "supabase/tap"                # Supabase CLI tap
tap "1password/tap"               # 1Password CLI tap

# --- CLI tools ---
brew "chezmoi"                    # Dotfile manager
brew "starship"                   # Fast, minimal terminal prompt
brew "zsh"                        # Z shell
brew "zoxide"                     # Directory jumper
brew "ripgrep"                    # Faster alternative to grep
brew "httpie"                     # Modern CLI for HTTP requests
brew "git"                        # Git version control
brew "gh"                         # GitHub CLI
brew "node"                       # Node.js runtime
brew "nvm"                        # Node.js version manager
brew "pnpm"                       # Fast, disk-efficient Node package manager
brew "yarn"                       # Alternative Node package manager
brew "cocoapods"                  # Dependency manager for iOS projects
brew "python3"                    # Python 3 runtime
brew "supabase"                   # Supabase CLI
brew "mas"                        # Mac App Store CLI tool
brew "fzf"                        # Fuzzy finder (used for file search, history, etc.)
brew "bat"                        # Enhanced `cat` with syntax highlighting
brew "fd"                         # Simplified, faster `find` alternative
brew "eza"                        # Modern `ls` replacement with tree view and icons
brew "tldr"                       # Simplified man pages with practical examples
brew "delta"                      # Syntax-highlighted git diff viewer
brew "vercel-cli"                 # Vercel CLI for preview deployments
brew "graphviz"                   # Render diagrams from `.dot` files
brew "deno"                       # Secure JavaScript/TypeScript runtime
brew "direnv"                     # Load per-project `.envrc` files into shell

# --- GUI apps (casks) ---
cask "raycast"                    # Universal launcher (replaces Spotlight)
cask "cursor"                     # AI-powered code editor (Cursor)
cask "zed"                        # Rust-based collaborative code editor
cask "visual-studio-code"         # VS Code editor
cask "warp"                       # Warp terminal GUI
cask "iterm2"                     # Terminal replacement
cask "notion"                     # Notes and personal knowledge base
cask "notion-calendar"            # Calendar app from Notion (formerly Cron)
cask "arc"                        # Arc browser by The Browser Company
cask "thebrowsercompany-dia"      # Dia AI-powered browser
cask "google-chrome"              # Chrome browser
cask "firefox"                    # Firefox browser
cask "postman"                    # API testing and debugging tool
cask "iina"                       # Modern media player
cask "karabiner-elements"         # Key remapping (e.g. map Caps Lock to Hyper)
cask "figma"                      # Interface design and prototyping tool
cask "setapp"                     # Subscription app manager (e.g. CleanMyMac, Ulysses)
cask "linear-linear"              # Project and issue tracker
cask "orbstack"                   # Lightweight Docker alternative with GUI
cask "brainfm"                    # AI-generated focus music
cask "spotify"                    # Music streaming client
cask "jordanbaird-ice"            # Open-source app bar manager (like Bartender)
cask "granola"                    # AI meeting note taker
cask "slack"                      # Team chat
cask "discord"                    # Developer / community chat
cask "messenger"                  # Facebook Messenger
cask "whatsapp"                   # WhatsApp desktop client
cask "telegram"                   # Telegram desktop client
cask "1password"                  # GUI password manager
cask "1password-cli"              # 1Password command-line tool
cask "github"                     # GitHub desktop app
cask "font-jetbrains-mono"        # Developer-friendly font from JetBrains
cask "ngrok"                      # Secure tunnels to localhost
cask "steam"                      # Steam client
cask "battle-net"                 # Battle.net client

# --- Mac App Store apps ---
mas "Day One", id: 1055511498     # Journaling app
mas "Things 3", id: 904237743     # Task manager
mas "Xcode", id: 497799835        # Apple dev tools and simulators
